["US-169 narrowed at 71st St. South through Saturday","Southbound US-169 is narrowed at 71st St. South until 3 p.m. Saturday for surface repairs.","I-244/Arkansas River bridge project – SW Blvd. narrowed Monday\nAll westbound I-244 traffic over the Arkansas River is shifted to the eastbound bridge, which will\naccommodate two lanes of two-way traffic until 2013. Plan for extra travel time in this corridor.\nScheduled closures include:\n Southwest Blvd. will be narrowed to one lane in each direction at the SW corner of the IDL from 7\na.m. to 7 p.m. Monday. Expect delays.\nRamps closed at the SW corner of the Inner Dispersal Loop, detour in place until 2013:\n Westbound US-64/SH-51 off-ramp to eastbound I-244/westbound US-64/SH-51 (south leg to\nwest leg IDL)\n Southbound US-75/westbound US-64/SH-51 off-ramp to westbound I-244/southbound US-75\n Eastbound I-244 on-ramp from 17th St.\n Westbound I-244 on-ramp from 7th St.\n The right lane of east and westbound 17th St. at the I-244 junction closed until further notice\nProject details can be found in the Traffic Advisories section of www.okladot.state.ok.us; click on WB\nI-244/Arkansas River Bridge Replacement Project","I-244 ramp closing at NW corner of the IDL Monday\n","The westbound I-244 off-ramp to northbound Tisdale Parkway will be closed from 9 a.m. Monday\nuntil further notice.","On-going Construction Projects:\nI-44 widening projects in Harvard Ave. corridor\n All lanes of Harvard Ave. are open at the I-44 junction; left turns are now allowed from Harvard\nAve. at this intersection.\n All three lanes of east and westbound I-44 are open between the US-64/SH-51 (Broken Arrow\nExpressway) junction and Harvard. Use caution as traffic adjusts to this new route, especially\nwhere westbound I-44 tapers to two lanes west of Harvard.","I-44 widening projects in Riverside Dr./Peoria Ave. corridor\nDrivers should be alert to new lane configurations on the eastbound frontage road (E. Skelly Dr.)\nbetween Riverside Dr. and Lewis Ave. (south of I-44). The shift changes the left turn lane from the\nfrontage road at Peoria Ave. to a left turn only, and the right lane will be for through traffic or right turns.\nContinued closures until further notice include:\n Peoria Ave. is narrowed to one lane in each direction at the I-44 junction. Expect delays and seek\nalternate route if possible.\n Troost Ave. and Trenton Ave. are closed at East Skelly Dr. (south of I-44).\n The westbound I-44 off-ramp to Riverside Dr.; use Peoria Ave. exit.\n The eastbound I-44 on-ramp from Riverside Dr. and the eastbound I-44 off-ramp to Lewis Ave.\n The eastbound I-44 off-ramp to Riverside Dr. and all lanes of westbound 51st St. between Lewis\nand Wheeling are closed permanently.\n All lanes of 53rd St. are closed at Riverside Dr. until further notice.\nSH-51 narrowed near SH-97 junction\nEast and westbound SH-51 is narrowed to one lane in each direction from three miles west of the SH-97\njunction to the Tulsa County/Creek County line until further notice as part of a pavement project.\nStreets narrow at I-244 junction (north leg of the IDL) nightly\nDrivers can expect various lane closures in the following areas at the I-244 junction (north leg of the\nInner Dispersal Loop) from 7 p.m. to 6 a.m. nightly until further notice for bridge rehabilitation.\n Northbound Boulder Ave.\n Southbound Cheyenne Ave.\n North and southbound Denver Ave.\n Southbound Main St.\nBe alert to crews working in the shoulders of I-244 above this bridge during these times.\nUS-75 narrowed, ramp closed at Main St./96th St.\nThe southbound US-75 on-ramp from Main St./96th St. in Jenks is closed until further notice as part of a\nbridge rehabilitation project. Drivers can expect various lane closures on southbound US-75 at this\njunction as part of this project. Drivers will be detoured to 111th St. for access to southbound US-75. The\nsouthbound off-ramp to Main St./96th St. will remain open."]